---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitCircleDiameter
source: html/db1708cb-8ace-2b9e-35ce-3a8b885554db.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitCircleDiameter Property

"Emit from Circle Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId FbxLightEmitCircleDiameter { get; }
```